package com.company;

public class FifTeen {
    //Убрал закомментированный код

    //Перенес комментарий в название переменной
    Long countOfWell;

    //Перенес комментарий в название метода
    getJsonWithEventIdAndWellId

    //Перенес комментарий в название метода

    getMapWithIdPosition

    //Перенес комментарий в название переменной

    Long averageDeep;

    //Перенес комментарий в название метода

    getEventWithoutCheckRight

    //Перенес комментарий в название переменной

    String jsonWithEventIdAndWellId;

    //Убрал избытоные комментарии

    //Комментарий описывал что делает вызываемый метод и методы, которые вызываются в нем. Описание действий выхываемых методов было перенесено перед их вызовом

    //Убраны шумные комментарии

    //Убрана избыточная информация из комментариев, оставлена только относящаюся к данному методу

    //Убраны устаревшие комментарии

    //Перенес комментарий в название переменной
    entityWithoutStartTime

    //Перенес комментарий в название метода
    createEntityFromJson

    //Перенес комментарий в название метода
    calculateStartTime
}