package com.company;

public class Ten {
// Переменная объявлялась в начале метода, и использовалась в болоке if перенес объявление в блок
// Переменная обьвлялась перед циклом, и использовалась как дефолтное значение для возврата, перенес объявление в цикл
// Лист обьявлся как переменная класса, а нужен был только в одном методе, перенес обьявление в метод
// Трансиентное поле объявлялось, как перменная класса а рассчитывалась в методе, перенс объявление в метод
// Переменная объявлалсь как публичное поле класса, сделал приватной
// Переменная была protected полем класса, у класса нет наследников, сделал приватной
// Лист содержащий результат метода объявлся в самом начале, метод мог закончиться ошибкой, перед заполнением листа, сделал объявление перед заполенением
// Между объявление переменной и ее использованием был большой кусок куда, вынес код в отдельный метод
// Возвращаемое методом значение объявлось в самом начале, перенес к месту исльзования
// Переменная объявлялась в начале метода а использовалась только в одном из условий, перенес объявление в условие
// Переменная объявлялась в цикле и использовалась после него, в одном из условий цикла был выход из метода, перенес объявление после цикла
// Переменная класса была public использовалась только в наследниках, сделал private
// Переменаая объявлалсь перед циклом, а использовалась во внутреннем цикле, перенес объявление в цикл
// Переменная объявлась перед if а использовалась во внутреннем if перенес объявление в if
// Переменная была уровня пакета а использовалась только в классе и его наследниках сделал protected
}
