package com.company;

public class ThreeTeen {
    //Прокомметирован метод для коллапса элементов листа, коментарий уместен так как бизнес логика довольна запутанна

    //Для хранения элементов используется множество, но по логике кажется что там нужно испольховать лист, однако если использовать лист будут проблемы с запросами к бд
    //Добавлен предупреждающий комментарий

    //При вызове апргейда проверяются права на создание, но по этому ендпоинту можно удалить элемент, поэтому добавлен предупреждающий комментарий

    //был прокоментирован сложный sql запрос

    //добавлен комментраий для правильного лока

    //добавлен комментарий поясняющий параметры при создании соединения

    //добавлены пояснения к неявным именам полей

}
