package com.company;

public class Twelve {
    // массив использовался для обработки значений, по которым нужно было отправить нотификаации всего было три значения
    // они добавлялись в массив каждый по фиксированному индесу, заменил на множество

    // массив использовался для возврата значений, если приходил 0 возврашался 0 элемент и тк. заменил на множество

    // массив использовался для примениния операций с объекту, необходимые операции клались в массив после чего в цикле они применялись к объекту, заменил на сет

    // в массиве находились дефолтные значения для поля, заменил на множество

    // в массиве находились результаты выполнения метода, для доспупа использвались индексы заменил на множество
}
